code-review/NRB_3471_3546/База_Стало/Reports/ВыпискаОСостоянииСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ВыпискаОСостоянииСчетаДепо</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автоисполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьФаксимилеВОтчетах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документооборот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВыпискиОперационныйДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормированияОтчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыКЭДО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭДО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ActionType</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/ВыпискаОСостоянииСчетаДепо/Forms/ФормаОтчета/Ext/Form/Module.bsl
//////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ВидОтчета = Перечисления.ВидыОтчетов.ВыпискаОСостоянииСчетаДЕПО;
	Если Не ЗначениеЗаполнено(Отчет.ПозицияВыпискиОперационныйДень) Тогда
		Отчет.ПозицияВыпискиОперационныйДень = 1;
	КонецЕсли;
	Отчет.ВидЗапроса = "Депонентов";
	
	Если Параметры.Свойство("Выписка") Тогда
		Отчет.Выписка = Параметры.Выписка;
		СформироватьОтчетСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВыпискаПриИзменении(Элемент)
	ВыпискаПриИзмененииНаСервере();
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент.Имя = "КомпоновщикНастроекНастройкиОтборЛевоеЗначение" Тогда
	    Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ РеквизитыЗаполнены() Тогда
		Возврат;
	КонецЕсли;
	СформироватьОтчетСервер();
КонецПроцедуры

&НаКлиенте
Процедура Отбор(Команда)
	Элементы.ФормаОтбор.Пометка = НЕ Элементы.ФормаОтбор.Пометка;
	УстановитьВидимостьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПеренумероватьВыписки(Команда)
	Если ЗначениеЗаполнено(Отчет.ДатаФормированияОтчетов) И ЗначениеЗаполнено(Отчет.Выписка) Тогда
		ПеренумероватьВыпискиНаСервере();
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо заполнить дату формирования и выписку";
		Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

&НаСервере
Процедура СформироватьОтчетСервер() Экспорт
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ЗаполнитьРеквизитыОтчетаПоВыписке();
	ОтчетОбъект.СформироватьОтчет(Результат);
	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
КонецПроцедуры

&НаКлиенте
Функция РеквизитыЗаполнены()
	Текст = "";	
	Если НЕ ЗначениеЗаполнено(Отчет.ДатаВыписки) Тогда
		Текст = Текст + ?(ЗначениеЗаполнено(Текст), Символы.ПС, "") + "Не выбрана дата.";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.ВидЗапроса) Тогда
		Текст = Текст + ?(ЗначениеЗаполнено(Текст), Символы.ПС, "") + "Не выбран вид запроса.";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.СчетДепо) Тогда
		Текст = Текст + ?(ЗначениеЗаполнено(Текст), Символы.ПС, "") + "Не выбран счет депо.";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Текст) Тогда
		Ошибка = Новый СообщениеПользователю;
		Ошибка.Текст = Текст;
		Ошибка.Сообщить();
	КонецЕсли;
	
	Возврат НЕ ЗначениеЗаполнено(Текст);
КонецФункции

&НаСервере
Процедура ВыпискаПриИзмененииНаСервере()
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ЗаполнитьРеквизитыОтчетаПоВыписке();
	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	Элементы.ГруппаОтбор.Видимость = Элементы.ФормаОтбор.Пометка;
	
	ОтборПоЦеннымБумагам	= Ложь;
	ОтборПоЭмитентам		= Ложь;
	
	ЭлементыОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		// Проверим, существует ли отбор по ценным бумагам, если нет - добавим
		Если СокрЛП(ЭлементОтбора.ЛевоеЗначение) = "ЦенныеБумаги" Тогда
			ОтборПоЦеннымБумагам = Истина;
			Продолжить;
		КонецЕсли;
		
		// Проверим, существует ли отбор по эмитентам, если нет - добавим
		Если СокрЛП(ЭлементОтбора.ЛевоеЗначение) = "Эмитенты" Тогда
			ОтборПоЭмитентам = Истина;
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ОтборПоЦеннымБумагам Тогда
		НовыйЭлемент = ЭлементыОтбора.Вставить(0, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦенныеБумаги");
		НовыйЭлемент.Использование = Ложь;
	КонецЕсли;
	
	Если НЕ ОтборПоЭмитентам Тогда
		НовыйЭлемент = ЭлементыОтбора.Вставить(1, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Эмитенты");
		НовыйЭлемент.Использование = Ложь;
	КонецЕсли;
	
	КоличествоАктивныхОтборов		= КоличествоАктивныхОтборов();
	Элементы.ФормаОтбор.Заголовок	= "Отбор" + ?(КоличествоАктивныхОтборов > 0, " (" + КоличествоАктивныхОтборов + ")", "");
КонецПроцедуры

&НаКлиенте
Функция КоличествоАктивныхОтборов()
	ЭлементыОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	КоличествоАктивных = 0;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.Использование Тогда
			КоличествоАктивных = КоличествоАктивных + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличествоАктивных;
КонецФункции

&НаСервере
Процедура ПеренумероватьВыпискиНаСервере()
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ПеренумероватьВыписки();
	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
КонецПроцедуры
